tap "codecrafters-io/tap"
tap "symfony-cli/tap"
brew "giflib"
brew "libpng"
brew "cairo"
brew "gh"
brew "glab"
brew "jpeg"
brew "librist"
brew "pango"
brew "librsvg"
brew "mkcert"
brew "node"
brew "node@18"
brew "node@20"
brew "nvm"
brew "openjdk@11"
brew "php"
brew "php-intl"
brew "php@8.1"
brew "pkgconf"
brew "pnpm"
brew "postgresql@14"
brew "python@3.13"
brew "rabbitmq-c"
brew "redis"
brew "tmux"
brew "volta"
brew "zsh"
brew "codecrafters-io/tap/codecrafters"
brew "symfony-cli/tap/symfony-cli"
cask "alt-tab"
cask "brave-browser"
cask "bruno"
cask "cursor"
cask "dbeaver-community"
cask "deltachat"
cask "figma"
cask "graphql-playground"
cask "insomnia"
cask "notion-calendar"
cask "obsidian"
cask "pgadmin4"
cask "raycast"
cask "rectangle"
cask "screen-studio"
cask "spotify"
cask "warp"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-pull-request-github"
vscode "kasik96.latte"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "prisma.vscode-graphql"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
go "github.com/bootdotdev/bootdev"
